const handler = async (m, {conn}) => {
  m.reply(global.Fem8vs8);
};
handler.command = /^(Fem8vs8|fem8vs8)$/i;
export default handler;
handler.admin = true
handler.group = true
handler.botAdmin = true

global.Fem8vs8 = ` 
╭─────╼🧸𝙑𝙎 𝙁𝙀𝙈🧸╾─────╮
│
│         🧸 𝘿𝙮𝙡𝙖𝙣𝘽𝙤𝙩-𝙈𝘿 🧸
│        ₊˚︶︶︶︶︶︶︶︶˚ ‧₊
│
│      ෆ 𝘔𝘰𝘥𝘰: 𝟾 𝚅𝚂 𝟾
│      ෆ 𝘏𝘰𝘳𝘢𝘳𝘪𐐫:
│    ‧₊⏰  🇵🇪 ⌇  🇧🇴 ⌇  🇦🇷      
│
│ㅤㅤʚ 𝙹𝚄𝙶𝙰𝙳𝙾𝚁𝙰𝚂🧸:
│
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│➼🧸• 
│➼🧸• 
│➼🧸• 
│➼🧸•
│   ㅤㅤ
│ㅤㅤʚ 𝚂𝚄𝙿𝙻𝙴𝙽𝚃𝙴𝚂🧸:
│➼🧸•
│➼🧸•
│
│  ⊹ ִֶָ𝙳𝙾𝙽𝙰𝙳𝙾𝚁𝙰 𝙳𝙴 𝚂𝙰𝙻𝙰🧸: 
│ㅤ
│➼🧸•
╰─────────────────────╯
`;