const handler = async (m, {conn, usedPrefix}) => {
  const pp = imagen4;
  try {
  } catch (e) {
  } finally {
    const name = await conn.getName(m.sender);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const str = `┏━═━═━═━═━═━═━═━═━═━┓
┃╭─────────────────
┃│🐲𝑯𝒐𝒍𝒂: @${m.sender.split`@`[0]}
┃│🐲𝑶𝒘𝒏𝒆𝒓 𝒅𝒆𝒍 𝑩𝒐𝒕:
┃│wa.me/523131937695
┃│🐲𝑩𝒐𝒕 𝒐𝒇𝒇: 
┃│wa.me/523131353118
┃│🐲𝑽𝒆𝒓𝒔𝒊𝒐𝒏: 𝟹.𝟸.𝟶
┃│🐲𝑭𝒆𝒄𝒉𝒂: ${date}
┃╰─────────────────
┗━═━═━═━═━═━═━═━═━═━┛

𝙰𝚀𝚄𝙸 𝙿𝚄𝙴𝙳𝙴 𝙶𝚄𝙰𝚁𝙳𝙰𝚁 𝙼𝙴𝙽𝚂𝙰𝙹𝙴𝚂
𝚀𝚄𝙴 𝚀𝚄𝙸𝙴𝚁𝙰𝚂 𝚅𝙴𝚁 𝙼𝙰𝚂 𝚃𝙰𝚁𝙳𝙴

┏━═━═━═━═━═━═━═━═━═━═┓
┃╭─────────────────
┃│𝑨𝒈𝒓𝒆𝒈𝒂𝒓-𝒂𝒍𝒂 𝒍𝒊𝒔𝒕𝒂
┃├────────────────╯
┃│🗳️ 𝒂𝒈𝒓𝒆𝒈𝒂𝒓𝒎𝒔𝒈 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ (𝒓𝒆𝒔𝒑𝒐𝒏𝒅𝒆 𝒂 𝒖𝒏 𝒕𝒆𝒙𝒕𝒐)
┃│🗳️ 𝒂𝒈𝒓𝒆𝒈𝒂𝒓𝒗𝒏 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ (𝒓𝒆𝒔𝒑𝒐𝒏𝒅𝒆 𝒂 𝒖𝒏𝒂 𝒏𝒐𝒕𝒂 𝒅𝒆 𝒗𝒐𝒛)
┃│🗳️ 𝒂𝒈𝒓𝒆𝒈𝒂𝒓𝒗𝒊𝒅𝒆𝒐 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ (𝒓𝒆𝒔𝒑𝒐𝒏𝒅𝒆 𝒂 𝒖𝒏 𝒗𝒊𝒅𝒆𝒐)
┃│🗳️ 𝒂𝒈𝒓𝒆𝒈𝒂𝒓𝒂𝒖𝒅𝒊𝒐 <𝒕𝒆𝒙𝒕𝒐> 
┃│🗳️ (𝒓𝒆𝒔𝒑𝒐𝒏𝒅𝒆 𝒂 𝒖𝒏 𝒂𝒖𝒅𝒊𝒐)
┃│🗳️ 𝒂𝒈𝒓𝒆𝒈𝒂𝒓𝒊𝒎𝒈 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ (𝒓𝒆𝒔𝒑𝒐𝒏𝒅𝒆 𝒂 𝒖𝒏𝒂 𝒊𝒎𝒂𝒈𝒆𝒏)
┃│🗳️ 𝒂𝒈𝒓𝒆𝒈𝒂𝒓𝒔𝒕𝒊𝒄𝒌𝒆𝒓 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ (𝒓𝒆𝒔𝒑𝒐𝒏𝒅𝒆 𝒂 𝒖𝒏 𝒔𝒕𝒊𝒄𝒌𝒆𝒓)
┃╰─────────────────
┗━═━═━═━═━═━═━═━═━═━═┛


┏━═━═━═━═━═━═━═━═━═━═┓
┃╭─────────────────
┃│𝑳𝒊𝒔𝒕𝒂-𝒅𝒆-𝒄𝒐𝒎𝒂𝒏𝒅𝒐𝒔
┃├────────────────╯
┃│🗳️ 𝒍𝒊𝒔𝒕𝒂𝒎𝒔𝒈
┃│🗳️ 𝒍𝒊𝒔𝒕𝒂𝒗𝒏
┃│🗳️ 𝒍𝒊𝒔𝒕𝒂𝒗𝒊𝒅𝒆𝒐
┃│🗳️ 𝒍𝒊𝒔𝒕𝒂𝒂𝒖𝒅𝒊𝒐
┃│🗳️ 𝒍𝒊𝒔𝒕𝒂𝒊𝒎𝒈
┃│🗳️ 𝒍𝒊𝒔𝒕𝒂𝒔𝒕𝒊𝒄𝒌𝒆𝒓 
┃╰─────────────────
┗━═━═━═━═━═━═━═━═━═━═┛


┏━═━═━═━═━═━═━═━═━═━═┓
┃╭─────────────────
┃│𝑽𝒆𝒓-𝑻𝒆𝒙𝒕𝒐𝒔 𝒐 𝑨𝒓𝒄𝒉𝒊𝒗𝒐𝒔
┃├────────────────╯
┃│🗳️ 𝒗𝒆𝒓𝒎𝒔𝒈 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒗𝒆𝒓𝒗𝒏 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒗𝒆𝒓𝒗𝒊𝒅𝒆𝒐 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒗𝒆𝒓𝒂𝒖𝒅𝒊𝒐 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒗𝒆𝒓𝒊𝒎𝒈 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒗𝒆𝒓𝒔𝒕𝒊𝒄𝒌𝒆𝒓 <𝒕𝒆𝒙𝒕𝒐>
┃╰─────────────────
┗━═━═━═━═━═━═━═━═━═━═┛


┏━═━═━═━═━═━═━═━═━═━═┓
┃╭─────────────────
┃│𝑬𝒍𝒊𝒎𝒊𝒏𝒂𝒓
┃├────────────────╯
┃│🗳️ 𝒆𝒍𝒊𝒎𝒊𝒏𝒂𝒓𝒎𝒔𝒈 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒆𝒍𝒊𝒎𝒊𝒏𝒂𝒓𝒗𝒏 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒆𝒍𝒊𝒎𝒊𝒏𝒂𝒓𝒗𝒊𝒅𝒆𝒐 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒆𝒍𝒊𝒎𝒊𝒏𝒂𝒓𝒂𝒖𝒅𝒊𝒐 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒆𝒍𝒊𝒎𝒊𝒏𝒂𝒓𝒊𝒎𝒈 <𝒕𝒆𝒙𝒕𝒐>
┃│🗳️ 𝒆𝒍𝒊𝒎𝒊𝒏𝒂𝒓𝒔𝒕𝒊𝒄𝒌𝒆𝒓 <𝒕𝒆𝒙𝒕𝒐>
┃╰─────────────────
┗━═━═━═━═━═━═━═━═━═━═┛`.trim();
    if (m.isGroup) {
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: m});
    } else {
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: fkontak2});
    }
    // conn.sendButton(m.chat, str, wm, pp, [['𝙼𝙴𝙽𝚄 𝙿𝚁𝙸𝙽𝙲𝙸𝙿𝙰𝙻', '/menu']], m, { mentions: [m.sender] })
  }
};
handler.help = ['cajafuerte'];
handler.tags = ['owner'];
handler.command = /^(cajafuerte)$/i;
handler.rowner = true;
handler.fail = null;
export default handler;
